Standard
Router(config)# access-list 1 deny host 192.168.1.2
Router(config)# access-list 1 permit any
Router(config)# interface g0/1
Router(config-if)# ip access-group 1 out

Extended
Router(config)# access-list 100 deny tcp host 192.168.1.2 192.168.2.0 0.0.0.255 eq 80
Router(config)# access-list 100 permit ip any any
Router(config)# interface g0/0
Router(config-if)# ip access-group 100 in

BGP
Router0:
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router bgp 1
Router(config-router)#network 10.0.0.0
Router(config-router)#network 40.0.0.0
Router(config-router)#neighbor 40.0.0.2 remote-as 2
Router(config-router)#ex

Router1:
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router bgp 2
Router(config-router)#network 20.0.0.0
Router(config-router)#network 40.0.0.0
Router(config-router)#network 50.0.0.0
Router(config-router)#neighbor 40.0.0.1 remote-as 1
Router(config-router)#%BGP-5-ADJCHANGE: neighbor 40.0.0.1 Up

Router(config-router)#neighbor 50.0.0.1 remote-as 3
Router(config-router)#ex

Router 2:
Router>
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router bgp 3
Router(config-router)#network 30.0.0.0
Router(config-router)#network 50.0.0.0
Router(config-router)#neighbor 50.0.0.2 remote-as 2


VPN 
(router0)
ip route 192.168.20.0 255.255.255.0 10.1.1.2
crypto isakmp policy 1
 encr aes
 authentication pre-share
 group 2
 lifetime 86400
exit

crypto isakmp key VPNKEY address 20.1.1.2

crypto ipsec transform-set MYSET esp-aes esp-sha-hmac

access-list 110 permit ip 192.168.10.0 0.0.0.255 192.168.20.0 0.0.0.255

crypto map MYMAP 10 ipsec-isakmp
 set peer 20.1.1.2
 set transform-set MYSET
 match address 110
exit

interface Serial0/1/0
 crypto map MYMAP
exit
(router 1 should be emplty)
((router2)
ip route 192.168.10.0 255.255.255.0 20.1.1.1
crypto isakmp policy 1
 encr aes
 authentication pre-share
 group 2
 lifetime 86400
exit

crypto isakmp key VPNKEY address 10.1.1.1

crypto ipsec transform-set MYSET esp-aes esp-sha-hmac

access-list 110 permit ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255

crypto map MYMAP 10 ipsec-isakmp
 set peer 10.1.1.1
 set transform-set MYSET
 match address 110
exit

interface Serial0/1/0
 crypto map MYMAP
exit

