1.local span

--switch--

conf t
Switch(config)#monitor session 1 source int fa0/1
Switch(config)#monitor session 1 destination int fa0/3
Switch(config)#ex

2. remote span

--switch1----

Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#remote-span
Switch(config-vlan)#ex
Switch(config)#monitor session 1 source int fa0/1	
Switch(config)#monitor session 1 destination remote vlan 10 reflector-port fa0/5
Switch(config)#ex
Switch#sh monitor detail

---switch2---


Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#remote-span
Switch(config-vlan)#ex
Switch(config)#monitor session 1 source remote vlan 10 
Switch(config)#monitor session 1 destination int fa0/2
Switch(config)#ex
Switch#sh monitor detail

(no monitor session 1 )
